Tekla Open API Reference for Tekla Structures 2025
ClipPlane.IsBorderVisible Property
Gets or sets a value indicating whether the clip plane border is visible.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsBorderVisible { get; set; }
Public Property IsBorderVisible As Boolean
	Get
	Set
Property Value
Type: Boolean
True if the clip plane border is visible otherwise false.
See Also
Reference
ClipPlane Class
Tekla.Structures.Model.UI Namespace